addons/food/users/controllers/DefaultController.php

    public function actionAdd_order_goods()
    {
        //添加订单
        $data=Yii::$app->request->get();
        $data['shop_id']=$this->mid;
        $data['uid']=$this->uid;
        $data['order_no']=date('Ymd').time().rand(11111,99999);
        $data['status']=1;
        if($this->table_id)
        {
            $data1=Food_shop_tables::find()->where('id=:tid',[':tid'=>$this->table_id])->asArray()->one();
            $data2=food_shop_tablezones::find()->where('id=:zid',[':zid'=>$data1['tablezonesid']])->asArray()->one();
---
SELECT * FROM `food_shop_tables` WHERE `id`='10'