addons/food/users/controllers/DefaultController.php

    public function actionWap_menuorder()
    {
        $session=Yii::$app->session;
        if(!($session->get('not_shop')))
        {
            $session->set('not_shop',false);
        }
        if($this->table_id=='' && $this->eid=='')
        {
            $session->set('not_shop',true);
        }else
        {
            $session->set('not_shop',false);
        }
        if(!$this->eid)
        {
            $session['employee']=[];
        }
        if($this->is_weixin())
        {
            // $this->userStatus();
        }
        if($this->table_id)
        {
            //更改桌号状态为已开台
            $session['user']=[
            'uid'=>$this->uid,
            'table_id'=>$this->table_id,
            ];
            $tables=Food_shop_tables::findOne($this->table_id);
            $tables->status=1;
            $return=$tables->save();
        }
        $data=Food_cat::find()->where(['shop_id'=>$this->mid,'pid'=>0,'status'=>1])->orderBy('id desc')->asArray()->all();
---
SELECT * FROM `food_shop_tables` WHERE `id`='7'
SELECT * FROM `food_cat` WHERE (`shop_id`='7') AND (`pid`=0) AND (`status`=1) ORDER BY `id` DESC