addons/food/shops/controllers/IndexController.php

    public function actionLeft_menu()
    {
    	if(Yii::$app->request->isPost){
            $data = Yii::$app->request->post();
    	}
        $cache = Yii::$app->cache;
    	$this->layout = 'layout2';
        if (isset(Yii::$app->session['cid']) || Yii::$app->session['employee']['role_id'] == 0) {
            $authInfoA = $cache->get('cache_data_authInfoA');
            $authInfoB = $cache->get('cache_data_authInfoB');
            if ($authInfoA === false) {
            	$authInfoA = Food_store_auth::find()->where(['auth_level'=>0,'is_show'=>1])->asArray()->orderBy('id asc')->all();
            	$authInfoB = Food_store_auth::find()->where(['auth_level'=>1,'is_show'=>1])->asArray()->orderBy('id asc')->all();
                $cache->set('cache_data_authInfoA', $authInfoA, 60*600000);
                $cache->set('cache_data_authInfoB', $authInfoB, 60*600000);
            }

        }else{
            $role_id = Yii::$app->session['employee']['role_id'];
            $authInfoA = $cache->get('cache_data_authInfoA'.$role_id );
---
SELECT * FROM `food_store_auth` WHERE (`auth_level`=0) AND (`is_show`=1) ORDER BY `id`
SELECT * FROM `food_store_auth` WHERE (`auth_level`=1) AND (`is_show`=1) ORDER BY `id`

    public function actionDo_goods_cat()
    {
        $datas = Food_cat::find()->where(['shop_id'=>$this->mid]);
        $pages = new Pagination(['totalCount' => $datas->count(),'pageSize' => '10']);
        $data = $datas->offset($pages->offset)->asArray()->limit($pages->limit)->all();
---
SELECT COUNT(*) FROM `food_cat` WHERE `shop_id`='24'
SELECT * FROM `food_cat` WHERE `shop_id`='24' LIMIT 10
SELECT * FROM `food_cat` WHERE (`shop_id`='24') AND (`pid`=0)

    public function actionDo_order_paid()
    {
        $datas = Food_order::find()->select('food_order.*,food_shop_tables.title')->leftJoin('food_shop_tables','food_order.table_id=food_shop_tables.id')->where('food_order.shop_id='.$this->mid.' and food_order.status=2');
        $pages = new Pagination(['totalCount' => $datas->count(),'pageSize' => '10']);
---
SELECT COUNT(*) FROM `food_order` LEFT JOIN `food_shop_tables` ON food_order.table_id=food_shop_tables.id WHERE food_order.shop_id=24 and food_order.status=2
SELECT `food_order`.*, `food_shop_tables`.`title` FROM `food_order` LEFT JOIN `food_shop_tables` ON food_order.table_id=food_shop_tables.id WHERE food_order.shop_id=24 and food_order.status=2 LIMIT 10

    public function actionDo_order_out_food()
    {
      $datas = Food_order::find()->select('food_order.*,food_shop_tables.title')->leftJoin('food_shop_tables','food_order.table_id=food_shop_tables.id')->where('food_order.shop_id='.$this->mid.' and food_order.status=2 and food_order.eat_type=2');
        $pages = new Pagination(['totalCount' => $datas->count(),'pageSize' => '10']);
---
SELECT COUNT(*) FROM `food_order` LEFT JOIN `food_shop_tables` ON food_order.table_id=food_shop_tables.id WHERE food_order.shop_id=24 and food_order.status=2 and food_order.eat_type=2
SELECT `food_order`.*, `food_shop_tables`.`title` FROM `food_order` LEFT JOIN `food_shop_tables` ON food_order.table_id=food_shop_tables.id WHERE food_order.shop_id=24 and food_order.status=2 and food_order.eat_type=2 LIMIT 10

    public function actionDo_ntrance()
    {
        $datas = Food_store_role::find()->where(['store_id'=>$this->mid]);
        $pages = new Pagination(['totalCount' => $datas->count(),'pageSize' => '10']);
---
SELECT COUNT(*) FROM `food_store_role` WHERE `store_id`='24'
SELECT * FROM `food_store_role` WHERE `store_id`='24' LIMIT 10

    public function actionDo_entrance_cook()
    {
        $role_id = Yii::$app->session['employee']['role_id'];

        if($role_id > 0){
             $cat_id = explode(',',Food_store_role::find()->select('cat_id')->where(['id'=>$id])->one());
        }else{
            $cat_id_all = Food_cat::find()->select('id')->where(['shop_id'=>$this->mid])->all();
            $cid_all = $this->arr2_arr1($cat_id_all,'id');
        }
        $data1 = Food_order::find()->where(['status'=>2,'shop_id'=>$this->mid])->andwhere('print_status in(0,1,2)')->asArray()->all();
---
SELECT `id` FROM `food_cat` WHERE `shop_id`='24'
SELECT * FROM `food_order` WHERE ((`status`=2) AND (`shop_id`='24')) AND (print_status in(0,1,2))

    public function actionDo_entrance_waiter()
    {
        $this->layout = 'layout3';

        $data1 = Food_shop_tables::find()->where(['status'=>0,'store_id'=>$this->mid])->asArray()->all();
---
SELECT * FROM `food_shop_tables` WHERE (`status`=0) AND (`store_id`='24')