addons/food/stores/controllers/HomepageController.php

    public function actionStores_type()
    {
        $_count=Food_shop_type::find()->where(['cid'=>$this->cid])->count();
---
SELECT COUNT(*) FROM `food_shop_type` WHERE `cid`='83'

    public function actionCreate_shop_type()
    {
        $model = new UploadForm();
        if(Yii::$app->request->isPost)
        {
            $post=Yii::$app->request->post();
            $model->imageFile = UploadedFile::getInstance($model, 'imageFile');
            if($model->upload($this->cid,'shop_logo'))
            {
                // 文件上传成功
                $type_img=$model->file_path;
            }
            unset($post['_csrf']);
            unset($post['UploadForm']);
            $post['type_img']=$type_img;
            $post['cid']=$this->cid;
            $post['create_time']=time();
            if(Yii::$app->db->createCommand()->insert('food_shop_type',$post)->execute())
---
INSERT INTO `food_shop_type` (`typename`, `type_img`, `cid`, `create_time`) VALUES ('éº»è¾£é¦™é”…', './uploads/images/83/shop_logo/201709011213159a8bedd31b04.jpg', '83', '1504231133')

    public function actionShopkeeper()
    {
        //获取所有的店铺
        $shop=Food_shop::find()->where(['company_id'=>$this->cid])->asArray()->all();
        $shop_id='';
        foreach($shop as $v)
        {
            $shop_id.=$v['id'].',';
        }
        $shop_id=rtrim($shop_id,',');
        $where=' role_id=0 and status=1 and shop_id in('.$shop_id.')';
        $count=Food_employee::find()->where($where)->count();
        $pageSize=Yii::$app->params['pageSize']['homepage'];
        $pager=new Pagination(['totalCount'=>$count,'pageSize'=>$pageSize]);
        $where1='';
        $data1='';
        if(Yii::$app->request->isPost)
        {
            $post=Yii::$app->request->post();
            if($post['truename'])
            {
                $where1=' and a.truename="'.$post['truename'].'"';
                $data1=Food_employee::find()->where(array('truename'=>$post['truename']))->asArray()->one();
---
SELECT * FROM `food_employee` WHERE username='hello1232231'