addons/food/publics/controllers/DefaultController.php

SELECT * FROM `food_company` WHERE `phone`='18094259843'
---
    public function actionSuper_login()
    {
        if(Yii::$app->request->isPost){
            $data = Yii::$app->request->post();
            $data1 = Food_company::find()->where(['phone'=>$data['phone']])->one();